import openai

client = openai.OpenAI(
    base_url="https://api.llm7.io/v1",
    api_key="unused"
)

prompt = (
    "سلام من یکسری کلمات کلیدی هست و احتمال مدل من کلمات غیر ضروری هم اورده "
    "که از کسی هست رزومه‌اش این موارد رو کم داره\n\n"
    "['frontend', 'backend', 'interfaces', 'appealing', 'seamless', 'experiences', 'users', 'visually', "
    "'collaborate', 'create', 'ensuring', 'work', 'solutions', 'infrastructure', 'providing', 'server', "
    "'databases', 'creating', 'aspects', 'application']\n\n"
    "و من ازت می‌خوام یه نقشه راه به کاربر بدی که باید چی‌ها یاد بگیره و چه کارهایی باید انجام بده و اگر دیدی کلمه‌ای اضافه و بی‌مورد هست در نظر نگیر. "
    "و باید با دقت بالا نقشه راه بدی. اگر هر زبان یا کتابخونه‌ای از اون زبان رو باید یاد بگیره بگو. در ضمن باید طبق استاندارد نقشه راه بدی و حتما انگلیسی باشه. "
    " من بهت گقتم با دقت باشه این دقت حتما باید بر اساس اون کلمات مشخص باشه "
    "و چون این پرامپت من با API وصل می‌کنم توضیحات اول و آخر رو نیاز ندارم و بهم توضیح نده، فقط نقشه راه به زبان انگلیسی بفرست. "
    "منظورم اینه که توضیح ندی اینه که مثل این دستوراتی هستی که پاسخ به من می‌دی. من یک نرم‌افزار دارم و با API به تو وصل شدم و می‌خوام به محض اینکه پرامپت فرستادم "
    "نقشه راه باشه و در اول و آخر هیچی نباشه و باید بدون فرمت خاصی باشه. باید فرمت txt باشه."
    "در ضمن نمیخوام نقشه راه کوتتاه و مختصر باشه میخوام با بالاترین دقت و بهترین جزئیات نسب به اون کلمات باشه و هرچی بیشتر و کامل تر بهتر "
    "خب در خط اخر فقط این جمله رو بنویس  به صورت اگلیسی این مسیر مسیر کلی و استاندارد میباشد و طبق مهارت های که باید یاد بگیرید باشه "
)

response = client.chat.completions.create(
    model="gpt-4.1-mini",
    messages=[
        {"role": "user", "content": prompt}
    ]
)

# دریافت خروجی
text = response.choices[0].message.content
for char in ['`', '*', '-']:
        text = text.replace(char, '')
# ذخیره در فایل متنی
with open("output.txt", "w", encoding="utf-8") as f:
    f.write(text)
